
// for 반복문
// for (초기식; 조건식; 증감식;) { 반복적으로 실행해야 되는 코드 }

// for문을 만나면 초기식 적어놓은 변수를 세팅함
// 실행 순서 : 초기식 -> ( 조건식 -> 실행코드 -> 증감식 ) -> 조건식 -> 실행코드 -> 증감식 ... -> 조건식이 false면 끝
// 초기식 : 하나의 변수를 할당해서 값을 집어넣는 식
// 조건식 : 반복을 해도 되는지 따지는 식 -> 초기식의 변수를 통한 비교식을 세움


for (var i = 1; i<= 3; i++) {
    console.log(i+ "번째 반복");            // 첫번째 사이클에서 그냥 실행이 아닌, 조건식에 따라 판단하여 실행
}



// 1. 초기식 때 i = 1
// 2. 조건문에서 1 <= 3 을 보면 true값 '실행해도 된다'     ㄱ
// 3. 코드 블록인 consol.log("1번째 반복")이 실행 됨      1사이클
// 4. 증감식인 i++이 실행되어 1 = 2                      -^
// 5. 조건문에서 2<= 3 을 보면 true값 '실행해도 된다'      ㄱ
// 6. 코드 블록인 consol.log("2번째 반복"); 이 실행됨     2사이클
// 7. 증감식인 i++이 실행되어 i = 3                      -^
// 8. 조건문에서 3 <= 3을 보면 true값 '실행해도 된다'      ㄱ
// 9. 코드 블록인 console.log("3번째 반복"); 이 실행됨    3사이클
// 10. 증감식인 i++이 실행되어 i = 4                     -^
// 11. 조건문에서 4 <= 4를 보면 false값이 되어 '끝내'가 된다 => 3사이클에서 종료 X => 4사이클에서 마무리



// 1부터 10까지 더하기
var result = 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10;

var sum = 0;
for (var n = 1; n <= 100; n++) {
    sum += n;       // sum + sum + n;
}
console.log(sum);
// 첫번째 사이클 : sum = sum + n;     // sum 0, n 1 = 0 + 1 = 1
// 두번째 사이클 : sum = sum + n;     // sum 1, n 2 = 1 + 2 = 3
// 세번째 사이클 : sum = sum + n;     // sum 3, n 3 = 3 + 3 = 6
// 네번째 사이클 : sum = sum + n;     // sum 6, n 4 = 6 + 4 = 10
// 다섯번째 사이클 :                  // sum 10, n 5 = 10 + 5 = 15
// 여섯번째 사이클 :                  // sum 15, n 6 = 15 + 6 = 21




// 중첩 반복문 : 그냥 for문 안에 for문을 쓰는 것

// 구구단! 2단만 만들어 보면
// 2 * n => n은 1부터 9까지
for (var dan = 2; dan <= 9; dan++) {
    for (k = 1; k <= 9; k++) {
        console.log(`${dan} * ${k} = ${dan * k}`);
    }
}